RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_ospi.h
/* OSPI interrupt constants definitions */
#define OSPI_INT_TERR                     OSPI_CTL_TERRIE                      /*!< transfer error interrupt enable */
#define OSPI_INT_TC                       OSPI_CTL_TCIE                        /*!< transfer complete interrupt enable */
#define OSPI_INT_FT                       OSPI_CTL_FTIE                        /*!< fifo threshold interrupt enable */
#define OSPI_INT_SM                       OSPI_CTL_SMIE                        /*!< status match interrupt enable */

/* OSPI flag definitions */
#define OSPI_FLAG_TERR                    OSPI_STAT_TERR                       /*!< transfer error flag */
#define OSPI_FLAG_TC                      OSPI_STAT_TC                         /*!< transfer complete flag */
#define OSPI_FLAG_FT                      OSPI_STAT_FT                         /*!< fifo threshold flag */
#define OSPI_FLAG_SM                      OSPI_STAT_SM                         /*!< status match flag */
#define OSPI_FLAG_BUSY                    OSPI_STAT_BUSY                       /*!< busy flag */

/* define the OSPI bit position and its register index offset */
#define OSPI_REGIDX_BIT(regidx, bitpos)   (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define OSPI_REG_VAL(ospix, offset)       (REG32((ospix) + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define OSPI_BIT_POS(val)                 ((uint32_t)(val) & 0x0000001FU)
#define OSPI_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
        | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define OSPI_REG_VAL2(ospix, offset)      (REG32((ospix) + ((uint32_t)(offset) >> 22)))
#define OSPI_BIT_POS2(val)                (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define OSPI_CTL_REG_OFFSET              ((uint32_t)0x00000000U)                /*!< CTL register offset */
#define OSPI_STAT_REG_OFFSET             ((uint32_t)0x00000020U)                /*!< STAT register offset */

/* OSPI interrupt flags */
typedef enum {
    OSPI_INT_FLAG_TERR      = OSPI_REGIDX_BIT2(OSPI_CTL_REG_OFFSET, 16U, OSPI_STAT_REG_OFFSET, 0U),          /*!< transfer error interrupt flag */
    OSPI_INT_FLAG_TC        = OSPI_REGIDX_BIT2(OSPI_CTL_REG_OFFSET, 17U, OSPI_STAT_REG_OFFSET, 1U),          /*!< transfer complete interrupt enable */
    OSPI_INT_FLAG_FT        = OSPI_REGIDX_BIT2(OSPI_CTL_REG_OFFSET, 18U, OSPI_STAT_REG_OFFSET, 2U),          /*!< fifo threshold interrupt flag */
    OSPI_INT_FLAG_SM        = OSPI_REGIDX_BIT2(OSPI_CTL_REG_OFFSET, 19U, OSPI_STAT_REG_OFFSET, 3U),          /*!< status match interrupt flag */
} ospi_interrupt_flag_enum;

#ifdef FW_DEBUG_ERR_REPORT
/* check peripherals */
#define NOT_OSPI_PERIPH(ospi_periph)                     (((ospi_periph) != OSPI0) && ((ospi_periph) != OSPI1))
/* check OSPI prescaler */
#define NOT_OSPI_PSC(psc)                                ((psc) > 255U)
/* check OSPI FIFO threshold */
#define NOT_OSPI_FIFO_THRESHOLD(fifo_threshold)          (((fifo_threshold) != OSPI_FIFO_THRESHOLD_1)  && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_2) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_3)  && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_4) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_5)  && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_6) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_7)  && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_8) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_9)  && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_10) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_11) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_12) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_13) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_14) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_15) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_16) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_17) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_18) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_19) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_20) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_21) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_22) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_23) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_24) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_25) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_26) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_27) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_28) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_29) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_30) && \
                                                          ((fifo_threshold) != OSPI_FIFO_THRESHOLD_31) && ((fifo_threshold) != OSPI_FIFO_THRESHOLD_32))

/* check OSPI sample shift */
#define NOT_OSPI_SAMPLE_SHIFTING(sample_shift)           (((sample_shift) != OSPI_SAMPLE_SHIFTING_NONE) && ((sample_shift) != OSPI_SAMPLE_SHIFTING_HALF_CYCLE))
/* check OPSI memory size */
#define NOT_OSPI_MESZ(device_size)                       (((device_size) != OSPI_MESZ_2_BYTES)    && ((device_size) != OSPI_MESZ_4_BYTES) && \
                                                          ((device_size) != OSPI_MESZ_8_BYTES)    && ((device_size) != OSPI_MESZ_16_BYTES) && \
                                                          ((device_size) != OSPI_MESZ_32_BYTES)   && ((device_size) != OSPI_MESZ_64_BYTES) && \
                                                          ((device_size) != OSPI_MESZ_128_BYTES)  && ((device_size) != OSPI_MESZ_256_BYTES) && \
                                                          ((device_size) != OSPI_MESZ_512_BYTES)  && ((device_size) != OSPI_MESZ_1024_BYTES) && \
                                                          ((device_size) != OSPI_MESZ_2_KBS)      && ((device_size) != OSPI_MESZ_4_KBS) && \
                                                          ((device_size) != OSPI_MESZ_8_KBS)      && ((device_size) != OSPI_MESZ_16_KBS) && \
                                                          ((device_size) != OSPI_MESZ_32_KBS)     && ((device_size) != OSPI_MESZ_64_KBS) && \
                                                          ((device_size) != OSPI_MESZ_128_KBS)    && ((device_size) != OSPI_MESZ_256_KBS) && \
                                                          ((device_size) != OSPI_MESZ_512_KBS)    && ((device_size) != OSPI_MESZ_1024_KBS) && \
                                                          ((device_size) != OSPI_MESZ_2_MBS)      && ((device_size) != OSPI_MESZ_4_MBS) && \
                                                          ((device_size) != OSPI_MESZ_8_MBS)      && ((device_size) != OSPI_MESZ_16_MBS) && \
                                                          ((device_size) != OSPI_MESZ_32_MBS)     && ((device_size) != OSPI_MESZ_64_MBS) && \
                                                          ((device_size) != OSPI_MESZ_128_MBS)    && ((device_size) != OSPI_MESZ_256_MBS) && \
                                                          ((device_size) != OSPI_MESZ_512_MBS)    && ((device_size) != OSPI_MESZ_1024_MBS) && \
                                                          ((device_size) != OSPI_MESZ_2048_MBS)   && ((device_size) != OSPI_MESZ_4096_MBS))
/* check OSPI CS high time */
#define NOT_OSPI_CS_HIGH_TIME(cs_hightime)               (((cs_hightime) != OSPI_CS_HIGH_TIME_1_CYCLE)  && ((cs_hightime) != OSPI_CS_HIGH_TIME_2_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_3_CYCLE)  && ((cs_hightime) != OSPI_CS_HIGH_TIME_4_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_5_CYCLE)  && ((cs_hightime) != OSPI_CS_HIGH_TIME_6_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_7_CYCLE)  && ((cs_hightime) != OSPI_CS_HIGH_TIME_8_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_9_CYCLE)  && ((cs_hightime) != OSPI_CS_HIGH_TIME_10_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_11_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_12_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_13_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_14_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_15_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_16_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_17_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_18_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_19_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_20_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_21_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_22_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_23_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_24_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_25_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_26_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_27_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_28_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_29_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_30_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_31_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_32_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_33_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_34_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_35_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_36_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_37_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_38_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_39_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_40_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_41_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_42_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_43_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_44_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_45_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_46_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_47_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_48_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_49_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_50_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_51_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_52_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_53_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_54_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_55_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_56_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_57_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_58_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_59_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_60_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_61_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_62_CYCLE) && \
                                                          ((cs_hightime) != OSPI_CS_HIGH_TIME_63_CYCLE) && ((cs_hightime) != OSPI_CS_HIGH_TIME_64_CYCLE))
/* check OSPI memory type  */
#define NOT_OSPI_MEMORY_TYPE(memory_type)                (((memory_type) != OSPI_MICRON_MODE)   && ((memory_type) != OSPI_MACRONIX_MODE) && \
                                                          ((memory_type) != OSPI_STANDARD_MODE) && ((memory_type) != OSPI_MACRONIX_RAM_MODE))
/* check wrap size */
#define NOT_OSPI_WRAP_SIZE(wrap_size)                    (((wrap_size) != OSPI_DIRECT)        && ((wrap_size) != OSPI_WRAP_16BYTES) && \
                                                          ((wrap_size) != OSPI_WRAP_32BYTES)  && ((wrap_size) != OSPI_WRAP_64BYTES) && \
                                                          ((wrap_size) != OSPI_WRAP_128BYTES))
/* check delay hold cycle */
#define NOT_OSPI_DELAY_HOLD_CYCLE(delay_hold_cycle)      (((delay_hold_cycle) != OSPI_DELAY_HOLD_NONE) && ((delay_hold_cycle) != OSPI_DELAY_HOLD_QUARTER_CYCLE))
/* check OSPI function mode */
#define NOT_OSPI_MODE(fmod)                              (((fmod) != OSPI_INDIRECT_WRITE) && ((fmod) != OSPI_INDIRECT_READ) && \
                                                          ((fmod) != OSPI_STATUS_POLLING) && ((fmod) != OSPI_MEMORY_MAPPED))
/* check status polling mode stop */
#define NOT_OSPI_AUTOMATIC_STOP_MATCH(stop)              (((stop) != OSPI_AUTOMATIC_STOP_MATCH))
/* check OSPI status polling match mode */
#define NOT_OSPI_MATCH_MODE(mode)                        (((mode) != OSPI_MATCH_MODE_AND) && ((mode) != OSPI_MATCH_MODE_OR))
/* check OSPI dumyc cycles */
#define NOT_OSPI_DUMYC_CYCLES(dumyc)                     (((dumyc) != OSPI_DUMYC_CYCLES_0)  && ((dumyc) != OSPI_DUMYC_CYCLES_1) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_2)  && ((dumyc) != OSPI_DUMYC_CYCLES_3) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_4)  && ((dumyc) != OSPI_DUMYC_CYCLES_5) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_6)  && ((dumyc) != OSPI_DUMYC_CYCLES_7) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_8)  && ((dumyc) != OSPI_DUMYC_CYCLES_9) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_10) && ((dumyc) != OSPI_DUMYC_CYCLES_11) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_12) && ((dumyc) != OSPI_DUMYC_CYCLES_13) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_14) && ((dumyc) != OSPI_DUMYC_CYCLES_15) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_16) && ((dumyc) != OSPI_DUMYC_CYCLES_17) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_18) && ((dumyc) != OSPI_DUMYC_CYCLES_19) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_20) && ((dumyc) != OSPI_DUMYC_CYCLES_21) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_22) && ((dumyc) != OSPI_DUMYC_CYCLES_23) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_24) && ((dumyc) != OSPI_DUMYC_CYCLES_25) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_26) && ((dumyc) != OSPI_DUMYC_CYCLES_27) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_28) && ((dumyc) != OSPI_DUMYC_CYCLES_29) && \
                                                          ((dumyc) != OSPI_DUMYC_CYCLES_30) && ((dumyc) != OSPI_DUMYC_CYCLES_31))
/* check OSPI instruction mode */
#define NOT_OSPI_INSTRUCTION_MODE(imod)                  (((imod) != OSPI_INSTRUCTION_NONE)    && ((imod) != OSPI_INSTRUCTION_1_LINE) && \
                                                           ((imod) != OSPI_INSTRUCTION_2_LINES) && ((imod) != OSPI_INSTRUCTION_4_LINES) && \
                                                           ((imod) != OSPI_INSTRUCTION_8_LINES))
/* check OSPI instruction size */
#define NOT_OSPI_INSTRUCTION_SIZE(inssz)                  (((inssz) != OSPI_INSTRUCTION_8_BITS)  && ((inssz) != OSPI_INSTRUCTION_16_BITS) && \
                                                           ((inssz) != OSPI_INSTRUCTION_24_BITS) && ((inssz) != OSPI_INSTRUCTION_32_BITS))
/* check OSPI address mode */
#define NOT_OSPI_ADDRESS_MODE(addrmod)                   (((addrmod) != OSPI_ADDRESS_NONE)    && ((addrmod) != OSPI_ADDRESS_1_LINE) && \
                                                          ((addrmod) != OSPI_ADDRESS_2_LINES) && ((addrmod) != OSPI_ADDRESS_4_LINES) && \
                                                          ((addrmod) != OSPI_ADDRESS_8_LINES))
/* check OSPI address DTR mode */
#define NOT_OSPI_ADDRDTR_MODE(addrdtr)                   (((addrdtr) != OSPI_ADDRDTR_MODE_DISABLE) && ((addrdtr) != OSPI_ADDRDTR_MODE_ENABLE))
/* check OSPI address size */
#define NOT_OSPI_ADDRESS_SIZE(addrsz)                    (((addrsz) != OSPI_ADDRESS_8_BITS)  && ((addrsz) != OSPI_ADDRESS_16_BITS) && \
                                                          ((addrsz) != OSPI_ADDRESS_24_BITS) && ((addrsz) != OSPI_ADDRESS_32_BITS))
/* check OSPI alternate bytes mode */
#define NOT_OSPI_ALTERNATE_BYTES_MODE(atlemod)           (((atlemod) != OSPI_ALTERNATE_BYTES_NONE)    && ((atlemod) != OSPI_ALTERNATE_BYTES_1_LINE) && \
                                                          ((atlemod) != OSPI_ALTERNATE_BYTES_2_LINES) && ((atlemod) != OSPI_ALTERNATE_BYTES_4_LINES) && \
                                                          ((atlemod) != OSPI_ALTERNATE_BYTES_8_LINES))
/* check OSPI alternate bytes DTR mode */
#define NOT_OSPI_ABDTR_MODE(abdtr)                       (((abdtr) != OSPI_ABDTR_MODE_DISABLE) && ((abdtr) != OSPI_ABDTR_MODE_ENABLE))
/* check OSPI alternate bytes size */
#define NOT_OSPI_ALTERNATE_BYTES_SIZE(altesz)            (((altesz) != OSPI_ALTERNATE_BYTES_8_BITS)  && ((altesz) != OSPI_ALTERNATE_BYTES_16_BITS) && \
                                                          ((altesz) != OSPI_ALTERNATE_BYTES_24_BITS) && ((altesz) != OSPI_ALTERNATE_BYTES_32_BITS))

#define NOT_OSPI_DATA_MODE(datamod)                      (((datamod) != OSPI_DATA_NONE)    && ((datamod) != OSPI_DATA_1_LINE) && \
                                                          ((datamod) != OSPI_DATA_2_LINES) && ((datamod) != OSPI_DATA_4_LINES) && \
                                                          ((datamod) != OSPI_DATA_8_LINES))
/* check OSPI data DTR mode */
#define NOT_OSPI_DADTR_MODE(dadtr)                       (((dadtr) != OSPI_DADTR_MODE_DISABLE) && ((dadtr) != OSPI_DADTR_MODE_ENABLE))
/* check OSPI operation type */
#define NOT_OSPI_OPTYPE(operation_type)                  (((operation_type) != OSPI_OPTYPE_COMMON_CFG) && ((operation_type) != OSPI_OPTYPE_READ_CFG) && \
                                                          ((operation_type) != OSPI_OPTYPE_WRITE_CFG)  && ((operation_type) != OSPI_OPTYPE_WRAP_CFG))
/* check the number of clock cycles between two read during automatic polling phases */
#define NOT_INTERVAL_NUM(interval)                       (((interval) > 0xFFFFU))
/* check OSPI interrupt */
#define NOT_OSPI_INTERRUPT(interrupt)                    (((interrupt) != OSPI_INT_TERR) && ((interrupt) != OSPI_INT_TC) && \
                                                          ((interrupt) != OSPI_INT_FT)   && ((interrupt) != OSPI_INT_SM))
/* check OSPI flag */
#define NOT_OSPI_FLAG(flag)                              (((flag) != OSPI_FLAG_TERR) && ((flag) != OSPI_FLAG_TC) && \
                                                          ((flag) != OSPI_FLAG_SM)   && ((flag) != OSPI_FLAG_BUSY))

